Repository: bunirules/gf2-software-p2-group-7-2
Catalog: logsim_lang/locale/logsim_*.po
Languages: es

source: Logic Simulator
es: Simulador Lógico اَلْعَرَبِيَّةُ

source: after which the state changes
es: después de los cuales cambia el estado

source: to
es: a

source: . Connection changed from
es: . La conexión cambió de

source: About
es: Información

source: About Logsim
es: Información de Logsim

source: Add
es: Agregar

source: Choose a circuit definition file
es: Elija un archivo para simular 씨발

source: Clock half period must be greater than 0
es: Periodo del reloj debe ser mayor que 0

source: Connection swap failed!
es: Error al intercambiar la conexión

source: Connection swapped successfully
es: Conexión intercambiada

source: Connections must be swapped from output to output
es: Las conexiones deben intercambiarse de salida a salida

source: Could not load file! File type must be a text file (*.txt) Would you like to open a different file?
es: ¡No se pudo cargar el archivo! El tipo de archivo debe ser un archivo de texto (*.txt) ¿Desea abrir un archivo diferente?

source: Could not load file! File type must be a text file (*.txt).
es: ¡No se pudo cargar el archivo! El tipo de archivo debe ser un archivo de texto (*.txt).

source: Could not parse file! (Error message below) Please select a different file.
es: ¡No se pudo analizar el archivo! (Mensaje de error a continuación) Seleccione un archivo diferente.

source: Could not save image! File type must be PNG.
es: ¡No se pudo guardar la imagen! El tipo de archivo debe ser PNG.

source: Cycles to run/continue for:
es: Ciclos para ejecutar/continuar:

source: Device names cannot be Keywords: 'CIRCUIT',
es: Nombres de dispositivos no pueden ser palabras clave: 'CIRCUIT',

source: Device names must start with a letter and be alphanumeric
es: Nombres de dispositivos deben comenzar con una letra y ser alfanuméricos

source: Error Count: {}
es: Cuenta de errores: {}

source: Error on line {}:
es: Error en linea {}:

source: Error opening file
es: Error al abrir archivo

source: Error saving file
es: Error al guardar el archivo

source: Error! Could not swap connection:
es: ¡Error! No se pudo intercambiar la conexión:

source: Error! Could not undo connection swap:
es: ¡Error! No se pudo deshacer:

source: Error! Network oscillating.
es: ¡Error! La red está oscilando.

source: Exit
es: Salir

source: Expected '('
es: Esperaba '('

source: Expected ')'
es: Esperaba ')'

source: Expected ';'
es: Esperaba ';'

source: Expected '=' or ','
es: Esperaba '=' o ','

source: Expected '>'
es: Esperaba '>'

source: Expected 'CIRCUIT'
es: Esperaba 'CIRCUIT'

source: Expected 'CONNECT'
es: Esperaba 'CONNECT'

source: Expected 'DEVICES'
es: Esperaba 'DEVICES'

source: Expected 'END'
es: Esperaba 'END'

source: Expected 'MONITOR'
es: Esperaba 'MONITOR'

source: Expected '{'
es: Esperaba '{'

source: Expected '}'
es: Esperaba '}'

source: Expected a number n > 0, the number of simulation cycles
es: Esperaba un numero n > 0, el número de ciclos de simulación

source: Expected number of inputs for AND gate (valid range:
es: Esperaba número de señales de entrada para puerta AND (rango válido:

source: Expected number of inputs for NAND gate (valid range:
es: Esperaba número de señales de entrada para puerta NAND (rango válido:

source: Expected number of inputs for NOR gate (valid range:
es: Esperaba número de señales de entrada para puerta NOR (rango válido:

source: Expected number of inputs for OR gate (valid range: 1-16)
es: Esperaba número de señales de entrada para puerta OR (rango válido:

source: Expected state, either 0(OFF) or 1(ON)
es: Esperaba el estado, 0(APAGADO) o 1(ENCENDIDO)

source: File
es: Archivo اَلْعَرَبِيَّةُ

source: File required
es: Archivo requerido

source: Input already connected
es: Entrada ya conectada

source: Input connected to input
es: Entrada conectada a entrada

source: Logic Simulator Created by
es: Simulador Lógico Creado por

source: Names cannot be Keywords: 'CIRCUIT', 'DEVICES', 'CONNECT',
es: Nombres no pueden ser palabras clave: 'CIRCUIT', 'DEVICES', 'CONNECT',

source: Not a supported device, supported devices: CLOCK,
es: No es dispositivo compatible, dispositivos compatibles: CLOCK,

source: Number of inputs must be between 1-16
es: Numero de entradas debe ser entre 1-16

source: Only output pins can be monitored
es: Solo se pueden monitorear los pines de salida

source: Open File
es: Abrir Archivo

source: Output connected to output
es: Salida conectada a salida

source: Pin names must start with a letter and be alphanumeric
es: Nombres de pines deben comenzar con una letra y ser alfanuméricos

source: Please select a new connection to replace the connection you wish to remove.
es: Seleccione una nueva conexión para reemplazar la conexión que desea eliminar.

source: Please select an existing connection to replace.
es: Seleccione una conexión existente para reemplazar.

source: Remove
es: Eliminar

source: Replace
es: Reemplazar

source: Replace connection:
es: Reemplazar conexión:

source: Reset View
es: Reestablecer Vista

source: Restart
es: Reiniciar

source: Run
es: Ejecutar

source: Save Full Plot
es: Guardar Imagen Completa

source: Save Image
es: Guardar Imagen

source: Save Visible Plot Area
es: Guardar área de imagen visible

source: Save file as ...
es: Guardar archivo como ...

source: Select a monitor point to add:
es: Seleccione una señal para monitorear:

source: Select a monitor point to remove:
es: Seleccione una señal para dejar de monitorear:

source: Select a switch to toggle:
es: Seleccione un interruptor para alternar:

source: Specified connection does not exist
es: La conexión especificada no existe

source: Specified device does not exist
es: El dispositivo especificado no existe

source: Specified port does not exist
es: El puerto especificado no existe

source: Successfully swapped connection into
es: Conexión intercambiada con éxito a

source: Successfully undid connection swap.
es: Intercambio de conexión deshecho con éxito.

source: This monitor point is already present
es: Este punto ya está monitoreado

source: This program requires you to load a circuit definition file. Would you like to select a file to load?
es: Debes cargar un archivo para simular. ¿Desea seleccionar un archivo para cargar?

source: Undo
es: Deshacer

source: Undo status message
es: Intentó deshacer intercambio

source: View
es: Vista

source: You chose the following file:
es: Elegiste el siguiente archivo:

source: You chose the following filename:
es: Elegiste el siguiente nombre de archivo:

source: and
es: y

source: monitor point does not exist
es: El punto no existe

source: unconnected inputs:
es: estas entradas no están conectadas:

source: with connection:
es: con conexión:
